<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"azurerm","backend":"b300bcdf8ab83ed6ab15d20a970c8c1275f6207f555b66b6e954e4601b4930a7","plan_job_ref":"Job Create Terraform plan (DEV) #11 at https://github.com/AudioProthese/openrms-core-infrastructure/actions/runs/14520477413","plan_out_hash":"45da9f04673090252cd616f781f33f0af722560e587b23b0ce28a73ae9c16448","plan_hash":"7dfbb50168f28ddc477d19fd649c0195fafdddb25def18d446bc4bb815a029ad","plan_text_format":"diff","version":"1.48.0"} -->
Terraform plan in __terraform/dev/__
<details>
<summary>Plan: 2 to add, 2 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place

Terraform will perform the following actions:

  # module.keyvault.azurerm_key_vault.this will be updated in-place
!~  resource "azurerm_key_vault" "this" {
!~      enable_rbac_authorization       = false -> true
        id                              = "/subscriptions/b33703ee-cc2d-4e8b-bd23-c259839be42e/resourceGroups/rg-openrmscore-dev/providers/Microsoft.KeyVault/vaults/openrmscore-dev-kv"
        name                            = "openrmscore-dev-kv"
        tags                            = {
            "environment" = "dev"
            "project"     = "openrmscore"
        }
#        (12 unchanged attributes hidden)

#        (1 unchanged block hidden)
    }

  # module.keyvault.azurerm_role_assignment.keyvault_admin will be created
+   resource "azurerm_role_assignment" "keyvault_admin" {
+       condition_version                = (known after apply)
+       id                               = (known after apply)
+       name                             = (known after apply)
+       principal_id                     = "************************************"
+       principal_type                   = (known after apply)
+       role_definition_id               = (known after apply)
+       role_definition_name             = "Key Vault Administrator"
+       scope                            = "/subscriptions/b33703ee-cc2d-4e8b-bd23-c259839be42e/resourceGroups/rg-openrmscore-dev/providers/Microsoft.KeyVault/vaults/openrmscore-dev-kv"
+       skip_service_principal_aad_check = (known after apply)
    }

  # module.keyvault.azurerm_role_assignment.service_principal will be created
+   resource "azurerm_role_assignment" "service_principal" {
+       condition_version                = (known after apply)
+       id                               = (known after apply)
+       name                             = (known after apply)
+       principal_id                     = "************************************"
+       principal_type                   = (known after apply)
+       role_definition_id               = (known after apply)
+       role_definition_name             = "Key Vault Secrets Officer"
+       scope                            = "/subscriptions/b33703ee-cc2d-4e8b-bd23-c259839be42e/resourceGroups/rg-openrmscore-dev/providers/Microsoft.KeyVault/vaults/openrmscore-dev-kv"
+       skip_service_principal_aad_check = (known after apply)
    }

  # module.network.azurerm_virtual_network.vnet will be updated in-place
!~  resource "azurerm_virtual_network" "vnet" {
        id                             = "/subscriptions/b33703ee-cc2d-4e8b-bd23-c259839be42e/resourceGroups/rg-openrmscore-dev/providers/Microsoft.Network/virtualNetworks/openrmscore-dev-vnet"
        name                           = "openrmscore-dev-vnet"
!~      subnet                         = [
-           {
-               address_prefixes                              = [
-                   "10.10.1.0/24",
                ]
-               default_outbound_access_enabled               = true
-               delegation                                    = [
-                   {
-                       name               = "aca-delegation"
-                       service_delegation = [
-                           {
-                               actions = [
-                                   "Microsoft.Network/virtualNetworks/subnets/join/action",
                                ]
-                               name    = "Microsoft.App/environments"
                            },
                        ]
                    },
                ]
-               id                                            = "/subscriptions/b33703ee-cc2d-4e8b-bd23-c259839be42e/resourceGroups/rg-openrmscore-dev/providers/Microsoft.Network/virtualNetworks/openrmscore-dev-vnet/subnets/openrmscore-dev-aca"
-               name                                          = "openrmscore-dev-aca"
-               private_endpoint_network_policies             = "Disabled"
-               private_link_service_network_policies_enabled = true
-               service_endpoint_policy_ids                   = []
-               service_endpoints                             = []
#                (2 unchanged attributes hidden)
            },
-           {
-               address_prefixes                              = [
-                   "10.10.2.0/24",
                ]
-               default_outbound_access_enabled               = true
-               delegation                                    = []
-               id                                            = "/subscriptions/b33703ee-cc2d-4e8b-bd23-c259839be42e/resourceGroups/rg-openrmscore-dev/providers/Microsoft.Network/virtualNetworks/openrmscore-dev-vnet/subnets/openrmscore-dev-appgw"
-               name                                          = "openrmscore-dev-appgw"
-               private_endpoint_network_policies             = "Disabled"
-               private_link_service_network_policies_enabled = true
-               service_endpoint_policy_ids                   = []
-               service_endpoints                             = []
#                (2 unchanged attributes hidden)
            },
+           {
+               address_prefixes                              = [
+                   "10.10.1.0/24",
                ]
+               default_outbound_access_enabled               = true
+               delegation                                    = [
+                   {
+                       name               = "aca-delegation"
+                       service_delegation = [
+                           {
+                               actions = [
+                                   "Microsoft.Network/virtualNetworks/subnets/action",
                                ]
+                               name    = "Microsoft.App/environments"
                            },
                        ]
                    },
                ]
+               id                                            = (known after apply)
+               name                                          = "openrmscore-dev-aca"
+               private_endpoint_network_policies             = "Disabled"
+               private_link_service_network_policies_enabled = true
+               service_endpoint_policy_ids                   = []
+               service_endpoints                             = []
#                (2 unchanged attributes hidden)
            },
+           {
+               address_prefixes                              = [
+                   "10.10.2.0/24",
                ]
+               default_outbound_access_enabled               = true
+               delegation                                    = []
+               id                                            = "/subscriptions/b33703ee-cc2d-4e8b-bd23-c259839be42e/resourceGroups/rg-openrmscore-dev/providers/Microsoft.Network/virtualNetworks/openrmscore-dev-vnet/subnets/openrmscore-dev-appgw"
+               name                                          = "openrmscore-dev-appgw"
+               private_endpoint_network_policies             = "Disabled"
+               private_link_service_network_policies_enabled = true
+               service_endpoint_policy_ids                   = []
+               service_endpoints                             = []
            },
        ]
        tags                           = {
            "environment" = "dev"
            "project"     = "openrmscore"
        }
#        (9 unchanged attributes hidden)
    }

Plan: 2 to add, 2 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Create Terraform plan (DEV) #11](https://github.com/AudioProthese/openrms-core-infrastructure/actions/runs/14520477413)